import React from "react";
import css from "./Book.module.css";

function Book() {
  return (
    <div className={css.bookContainer}>
      <div className={css.imageContainer}>
        <img src="img/1.jpg" alt="Book" className={css.bookImage} />
      </div>
      <div className={css.descriptionContainer}>
        <h2 className={css.title}>Дюна</h2>
        <p className={css.author}>Френк Герберт</p>
        <p className={css.description}>
          Найцінішими у Всесвіті є меланж, або як їх називають по іншому —
          прянощі. Вони допомагають у подовженні життя і, навіть, сприяють
          міжзоряним подорожам. І знайти її можна лише на непривітній пустельній
          планеті Арракіс. Той, хто стане володарем Арракісі контролюватиме
          прянощі. А хто контролює прянощі — керує Всесвітом. Коли Імператор
          позбавляє клан Харконненів звання правлячого і віддає цей титул
          Атрідам, Харконнени вбивають герцога Лето Атріда. Його син Пол і
          наложниця Джессіка тікають у пустелю. Щоб помститися за батька і
          відвоювати планету в Харконненів, Пол має здобути довіру фримерів —
          корінних мешканців Арракіса — і повести крихітну армію проти
          незліченних сил супротивника.
        </p>
      </div>
    </div>
  );
}

export default Book;
